export const tarifData = [
  { name: 1, value: 1.4 },
  { name: 2, value: 1.45 },
  { name: 3, value: 1.5 },
  { name: 4, value: 1.55 },
  { name: 5, value: 1.6 },
  { name: 6, value: 1.65 },
  { name: 7, value: 1.7 },
  { name: 8, value: 1.75 },
  { name: 9, value: 1.8 },
  { name: 10, value: 1.85 },
  { name: 11, value: 1.9 },
  { name: 12, value: 1.95 },
  { name: 13, value: 2.0 },
  { name: 14, value: 2.08 },
  { name: 15, value: 2.16 },
  { name: 16, value: 2.24 },
  { name: 17, value: 2.32 },
  { name: 18, value: 2.4 },
  { name: 19, value: 2.48 },
  { name: 20, value: 2.56 },
  { name: 21, value: 2.64 },
  { name: 22, value: 2.72 },
  { name: 23, value: 2.8 },
  { name: 24, value: 2.88 },
  { name: 25, value: 2.96 },
  { name: 26, value: 3.04 },
  { name: 27, value: 3.12 },
  { name: 28, value: 3.2 },
  { name: 29, value: 3.28 },
  { name: 30, value: 3.36 },
  { name: 31, value: 3.44 },
  { name: 32, value: 3.52 },
  { name: 33, value: 3.6 },
  { name: 34, value: 3.68 },
  { name: 35, value: 3.76 },
  { name: 36, value: 3.84 },
  { name: 37, value: 3.92 },
  { name: 38, value: 4.0 },
  { name: 39, value: 4.08 },
  { name: 40, value: 4.16 },
  { name: 41, value: 4.24 },
  { name: 42, value: 4.32 },
  { name: 43, value: 4.4 },
  { name: 44, value: 4.48 },
  { name: 45, value: 4.56 },
  { name: 46, value: 4.64 },
  { name: 47, value: 4.72 },
  { name: 48, value: 4.8 },
  { name: 49, value: 4.88 },
  { name: 50, value: 4.96 },
  { name: 51, value: 5.04 },
  { name: 52, value: 5.12 },
  { name: 53, value: 5.2 },
  { name: 54, value: 5.28 },
  { name: 55, value: 5.36 },
  { name: 56, value: 5.44 },
  { name: 57, value: 5.52 },
  { name: 58, value: 5.6 },
  { name: 59, value: 5.68 },
  { name: 60, value: 5.76 }
];

export const vislugaData = [
  { name: "Без вислуги", value: 0 },
  { name: "Від 1 до 5 років", value: 25 },
  { name: "Від 5 до 10 років", value: 30 },
  { name: "Від 10 до 15 років", value: 35 },
  { name: "Від 15 до 20 років", value: 40 },
  { name: "Від 20 до 25 років", value: 45 },
  { name: "25 і більше", value: 50 }
];

export const secretData = [
  { name: "Таємно", value: 10 },
  { name: "Цілком таємно", value: 15 },
  { name: "Особливої важливості", value: 20 }
];

export const livingWageData = [
  { name: 2018, value: 1762 },
  { name: 2019, value: 1921 },
  { name: 2020, value: 2102 },
  { name: 2021, value: 2481 },
  { name: 2022, value: 2481 },
  { name: 2023, value: 2684 },
  { name: 2024, value: 3028 },
  { name: 2025, value: 3028 }
];

export const militaryRanksData = [
    {
        "name": "Рекрут",
        "value": 440
    },
    {
        "name": "Солдат, матрос",
        "value": 530
    },
    {
        "name": "Старший солдат, старший матрос",
        "value": 600
    },
    {
        "name": "Молодший сержант, старшина 2 статті",
        "value": 670
    },
    {
        "name": "Сержант, старшина 1 статті",
        "value": 740
    },
    {
        "name": "Старший сержант, головний старшина",
        "value": 810
    },
    {
        "name": "Головний сержант, головний корабельний старшина",
        "value": 880
    },
    {
        "name": "Штаб-сержант, штаб-старшина",
        "value": 950
    },
    {
        "name": "Майстер-сержант, майстер-старшина, ",
        "value": 1020
    },
    {
        "name": "Старший майстер-сержант, старший майстер-старшина",
        "value": 1040
    },
    {
        "name": "Головний майстер-сержант, головний майстер-старшина",
        "value": 1060
    },
    {
        "name": "Молодший лейтенант",
        "value": 1090
    },
    {
        "name": "Лейтенант",
        "value": 1130
    },
    {
        "name": "Старший лейтенант",
        "value": 1200
    },
    {
        "name": "Капітан, капітан-лейтенант",
        "value": 1270
    },
    {
        "name": "Майор, капітан 3 рангу",
        "value": 1340
    },
    {
        "name": "Підполковник, капітан 2 рангу",
        "value": 1410
    },
    {
        "name": "Полковник, капітан 1 рангу",
        "value": 1480
    },
    {
        "name": "Бригадний генерал, коммодор",
        "value": 1550
    },
    {
        "name": "Генерал-майор, контр-адмірал",
        "value": 1620
    },
    {
        "name": "Генерал-лейтенант, віце-адмірал",
        "value": 1690
    },
    {
        "name": "Генерал, адмірал, генерал служби цивільного захисту",
        "value": 1760
    }
]

export const positionsData = [
  { name: "на посадах, крім зазначених нижче", value: 65 },
  { name: "у клініках інфекційних хвороб, інфекційних відділеннях, палатах та ізоляторах для інфекційних хворих військово-медичних клінічних центрів усіх найменувань, військових госпіталів, лазаретів, центрів медичної реабілітації та санаторного лікування, військових санаторіїв", value: 68.3 },
  { name: "у відділеннях, палатах та ізоляторах для гельмінтологічних хворих військово-медичних клінічних центрів усіх найменувань, військових госпіталів і лазаретів", value: 68.3 },
  { name: "у відділеннях, відділах, палатах для опікових і спінальних хворих (в тому числі нейрохірургічних відділень, клінік) госпіталів, військово-медичних клінічних центрів усіх найменувань, клінік та лазаретів, а також відділень для спінальних хворих санаторіїв", value: 68.3 },
  { name: "у неврологічних (ангіоневрологічних) відділеннях для хворих з порушеннями мозкового кровообігу", value: 68.3 },
  { name: "у відділеннях госпіталів, військово-медичних клінічних центрів усіх найменувань та клінік, де застосовують апарат \"Штучна нирка\"", value: 68.3 },
  { name: "в алергологічних кабінетах", value: 68.3 },
  { name: "в епідеміологічних, лабораторних, санітарно-гігієнічних, санітарно-епідеміологічних, санітарно-епідеміологічного нагляду відділах установ Служби превентивної медицини", value: 68.3 },
  { name: "у відділеннях і палатах гнійної хірургії для лікування хворих з хірургічними гнійними захворюваннями та ускладненнями", value: 68.3 },
  { name: "у клініках, відділеннях і палатах, призначених виключно для хворих на шкірно-венерологічні захворювання", value: 68.3 },
  { name: "у відділеннях малоінвазивної хірургії та ендоскопії", value: 68.3 },
  { name: "у відділеннях (кабінетах) ультразвукової діагностики, комп’ютерної томографії та магніто-резонансної діагностики", value: 68.3 },
  { name: "в центрах крові, відділень станцій переливання крові у військово-медичних клінічних центрах усіх найменувань, військових госпіталях, відділеннях трансфузіології, заготівлі та переробки крові та її компонентів, відділеннях кріоконсервування клітин крові та кісткового мозку", value: 68.3 },
  { name: "начальників та заступників начальників установ Служби превентивної медицини", value: 68.3 },
  { name: "лікарів, фельдшерів і лаборантів окремих медичних батальйонів і рот, санітарно-контрольних пунктів, що виконують бактеріологічні та вірусологічні дослідження", value: 68.3 },
  { name: "лікарів, лікарів анестезіологів-реаніматологів (у тому числі начальників, старших ординаторів, ординаторів), фельдшерів, медичних сестер незалежно від назви посад, молодших медичних сестер усіх найменувань відділень гіпербаричної та гіпобаричної оксигенації, клінік (відділень, палат, груп) анестезіології, реанімації та інтенсивної терапії військово-медичних клінічних центрів усіх найменувань, госпіталів, медичних батальйонів", value: 68.3 },
  { name: "лікарів-хірургів усіх найменувань, лікарів-ендоскопістів, лікарів-анестезіологів та оперують хворих у окремих медичних (медико-санітарних) батальйонах, медичних ротах, амбулаторно-поліклінічних і санаторно-курортних закладах", value: 68.3 },
  { name: "керівників-лікарів, лікарів, фельдшерів і лаборантів лабораторій (у тому числі їх підрозділів - відділів, відділень) і клінік лабораторної діагностики під час роботи з: живим збудником інфекційних захворювань або хворими тваринами", value: 68.3 },
  { name: "вірусами, які викликають захворювання", value: 68.3 },
  { name: "хімічними речовинами, віднесеними до алергенів, що визначені нормативно-правовими актами Міністерства охорони здоров’я України", value: 68.3 },
  { name: "лікарів Євпаторійського центрального дитячого клінічного санаторію, які безпосередньо зайняті лікуванням психоневрологічних хворих", value: 68.3 },
  { name: "на посадах, пов’язаних з іонізуючим випромінюванням чи з радіоактивними речовинами в рентгенівських, рентгенофлюорографічних, радіологічних, рентгенорадіологічних, токсико-радіологічних, санітарно-токсико-радіологічних, радіаційно-токсикологічних, радіоізотопної діагностики і спеціальних відділах, відділеннях, кабінетах, лабораторіях чи на станціях, радіологічних центрах (якщо у військовій частині є штатний рентгенівський кабінет, а посаду рентгенолога штатом не передбачено і виконання його функцій наказом командира військової частини покладено на іншого лікаря-офіцера військової частини, цьому лікарю надбавка виплачується на загальних підставах)", value: 68.3 },
  { name: "центрального санітарно-епідеміологічного управління Міністерства оборони України - за час безпосередньої роботи в осередках інфекційних хвороб (крім чуми і холери), відрядженим в осередки за наказами відповідних начальників", value: 68.3 },
  { name: "немедичного складу патолого-анатомічних лабораторій і відділень", value: 68.3 },
  { name: "на посадах в органах управління та військових частинах Військової служби правопорядку Збройних Сил України", value: 68.3 },
  { name: "проходять військову службу в підземних умовах (на глибині понад 20 метрів під землею), а також у заглиблених захищених спеціальних фортифікаційних спорудах пунктів управління згідно з Переліком, затвердженим Головнокомандувачем Збройних Сил України", value: 68.3 },
  { name: "в туберкульозних відділеннях, клініка5", value: 71.5 },
  { name: "палатах та ізоляторах для туберкульозних хворих військово-медичних клінічних центрів усіх найменувань, військових госпіталів, лазаретів, центрів медичної реабілітації та санаторного лікування, військових санаторіїв", value: 71.5 },
  { name: "медичного складу патолого-анатомічних лабораторій і відділень", value: 71.5 },
  { name: "лікарів-лаборантів і лаборантів військово-медичних клінічних центрів усіх найменувань, госпіталів і лазаретів, які виконують дослідження з туберкульозних та інфекційних відділень, клінік", value: 71.5 },
  { name: "в психіатричних і психоневрологічних клініках, відділеннях, кабінетах, палатах та ізоляторах для психічних хворих госпіталів, військово-медичних клінічних центрів усіх найменувань, лазаретів і поліклінік", value: 71.5 },
  { name: "на посадах лікарів-хірургів усіх найменувань, лікарів-ендоскопістів, лікарів-анестезіологів та які оперують хворих у військово-медичних клінічних центрах усіх найменувань, військових госпіталях та їх філіях", value: 78 },
  { name: "на посадах у складі бойових обслуг (чергових бойових обслуг) (змін) військових частин і підрозділів, які несуть бойові чергування з протиповітряної оборони, протичовнової оборони, протипідводно-диверсійної оборони та забезпечують недоторканність повітряного простору та простору в межах територіального моря України, а також виконують функцію з прикриття важливих об’єктів згідно із затвердженим Міністром оборони України переліком підрозділів і військових частин (за умови несення в минулому місяці не менше чотирьох бойових чергувань)", value: 78 },
  { name: "на посадах командирів і старших механіків-водіїв танків і гаубичних самохідно-артилерійських установок у підрозділах зберігання та обслуговування бронетанкової техніки", value: 78 },
  { name: "на посадах: наземних авіаційних спеціалістів, які забезпечують безпеку польотів літаків і вертольотів згідно із затвердженим Міністром оборони України переліком посад", value: 78 },
  { name: "наземного інженерно-технічного складу, які беруть участь у підготовці та проведенні випробувань, забезпеченні безпеки польотів за методикою льотних випробувань авіаційних комплексів та іншого бортового і навісного обладнання літальних апаратів згідно із затвердженим Міністром оборони України переліком посад", value: 78 },
  { name: "на посадах інструкторського та викладацького складу навчальних центрів (центрів підготовки), полігонів", value: 81.3 },
  { name: "на посадах у дисциплінарних військових частинах", value: 81.3 },
  { name: "на посадах інструкторів з бойової армійської системи", value: 81.3 },
  { name: "військовослужбовці, які мають сертифікат інструктора бойової армійської системи (за умови фактичного проведення занять з особовим складом за цією системою)", value: 81.3 },
  { name: "в екіпажах танків, самохідно-артилерійських установок, зенітних самохідних установок, бойових машин піхоти, бойових розвідувальних і десантних машин, самохідних гаубиць", value: 84.5 },
  { name: "у навчальних танкових частинах і підрозділах на посадах старших інструкторів та інструкторів по водінню танків і самохідно-артилерійських установок, які належать за штатом до обслуги екіпажів цих бойових машин як старші механіки-водії або механіки-водії", value: 84.5 },
  { name: "на посадах, що належать до обслуги самохідних пускових установок зенітних ракетних комплексів і самохідних станцій виявлення і наведення цих комплексів (на гусеничному шасі)", value: 84.5 },
  { name: "які проходять службу в батальйоні почесної варти та оркестрі почесної варти військової частини А0222", value: 85 },
  { name: "на посадах водолазів (за умови допущення до виконання водолазних робіт)", value: 87.8 },
  { name: "посадах в екіпажах надводних кораблів, морських суден, самохідних рейдових суден, катерів", value: 87.8 },
  { name: "на посадах в управліннях груп, ланок, загонів, дивізіонів, бригад та центрів, до складу яких входять кораблі, морські судна, самохідні рейдові судна або катери, які постійно розміщені на кораблях і морських суднах", value: 87.8 },
  { name: "на посадах у з’єднаннях, військових частинах і підрозділах морської піхоти та окремих військових частинах Військово-Морських Сил Збройних Сил України (згідно з переліком органів управління, з’єднань, військових частин і підрозділів, затвердженим Міністром оборони України)", value: 87.8 },
  { name: "на посадах у військових частинах і підрозділах спеціального призначення Військової служби правопорядку у Збройних Силах України (згідно з переліком органів управління, з’єднань, військових частин і підрозділів, затвердженим Міністром оборони України)", value: 87.8 },
  { name: "на посадах у з’єднаннях, військових частинах і підрозділах Високомобільних десантних військ (Десантно-штурмових військ), військових навчальних закладах, що готують осіб офіцерського складу для Високомобільних десантних військ (Десантно-штурмових військ), десантно-штурмових підрозділах (згідно з переліком органів управління, з’єднань, військових частин і підрозділів, затвердженим Міністром оборони України), у пошуково-рятувальній і парашутно-десантній службах (центрах, групах), штатних спортивних командах з парашутних видів спорту, парашутистів-випробувачів", value: 87.8 },
  { name: "на посадах у військових частинах Сил спеціальних операцій Збройних Сил України (згідно з переліком органів управління, з’єднань, військових частин і підрозділів, затвердженим Міністром оборони України)", value: 87.8 },
  { name: "на посадах штатних пожежних розрахунків (команд) військових частин (за час виконання робіт з ліквідації пожеж)", value: 94.3 },
  { name: "на посадах льотного складу льотного екіпажу повітряних суден", value: 100 },
  { name: "на посадах льотного складу екіпажу пасажирського і вантажного салону повітряних суден", value: 100 },
  { name: "посадах льотно-випробного складу, які входять до складу екіпажу літальних апаратів", value: 100 },
  { name: "у лабораторіях інфекційної імунології госпіталів, військово-медичних клінічних центрів і поліклінік", value: 100 },
  { name: "пройшли підготовку снайперів, мають відповідний сертифікат та виконують обов’язки снайпера", value: 100 },
  { name: "які пройшли навчання, отримали відповідні сертифікати щодо застосування протитанкових ракетних комплексів “Стугна-П” чи “Корсар” (далі – ПТРК) та займають посади у підрозділах цих ПТРК", value: 100 },
   { 
    name: "які проходять службу в батареї протитанкових керованих комплексів військової частини А1499", 
    value: 100 
  },
  { 
    name: "які проходять військову службу за контрактом (призовом) на посадах рядового, сержантського, старшинського та офіцерського складу у військових частинах А1556, А1778, А1927, А4267, А3715, А3892, А3029, А3620, А0952", 
    value: 100 
  },
  { 
    name: "які відряджені для виконання завдань з охорони та оборони острова Зміїний (за час виконання таких завдань)", 
    value: 100 
  },
  { 
    name: "які пройшли навчання, отримали відповідні сертифікати щодо застосування безпілотних авіаційних комплексів (далі – БпАК) та займають посади (крім військових навчальних закладів і органів військового управління), за якими військово-обліковою спеціальністю та функціональними обов’язками передбачено виконання польотів у складі зовнішнього екіпажу БпАК, мають допуск до виконання польотів і виконують польоти за відповідними планами підготовки (бойові, спеціальні польоти) у складі зовнішнього екіпажу БпАК", 
    value: 100 
  }
];

export const premiyaData = [
  { name: 1, value1: 590, value2: 633 },
  { name: 2, value1: 567, value2: 603 },
  { name: 3, value1: 544, value2: 578 },
  { name: 4, value1: 535, value2: 556 },
  { name: 5, value1: 523, value2: 534 },
  { name: 6, value1: 513 },
  { name: 7, value1: 505 },
  { name: 8, value1: 492 },
  { name: 9, value1: 489 },
  { name: 10, value1: 486 },
  { name: 11, value1: 483 },
  { name: 12, value1: 480 },
  { name: 13, value1: 467 },
  { name: 14, value1: 455 },
  { name: 15, value1: 443 },
  { name: 16, value1: 429 },
  { name: 17, value1: 420 },
  { name: 18, value1: 412 },
  { name: 19, value1: 405 },
  { name: 20, value1: 395},
  { name: 21, value1: 390},
  { name: 22, value1: 390},
  { name: 23, value1: 390},
  { name: 24, value1: 390},
  { name: 25, value1: 390},
  { name: 26, value1: 390},
  { name: 27, value1: 390},
  { name: 28, value1: 390},
  { name: 29, value1: 390},
  { name: 30, value1: 390},
  { name: 31, value1: 390},
  { name: 32, value1: 390},
  { name: 33, value1: 390},
  { name: 34, value1: 390},
  { name: 35, value1: 390},
  { name: 36, value1: 390},
  { name: 37, value1: 390},
  { name: 38, value1: 390},
  { name: 39, value1: 390},
  { name: 40, value1: 390},
  { name: 41, value1: 390},
  { name: 42, value1: 390},
  { name: 43, value1: 390},
  { name: 44, value1: 390},
  { name: 45, value1: 390},
  { name: 46, value1: 390},
  { name: 47, value1: 390},
  { name: 48, value1: 390},
  { name: 49, value1: 390},
  { name: 50, value1: 390},
  { name: 51, value1: 390},
  { name: 52, value1: 390},
  { name: 53, value1: 390},
  { name: 54, value1: 390},
  { name: 55, value1: 390},
  { name: 56, value1: 390},
  { name: 57, value1: 390},
  { name: 58, value1: 390},
  { name: 59, value1: 390},
  { name: 60, value1: 390},
]